#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//
//int main()
//{
//	//二维数组
//	int a[3][4] = { 0 };
//	printf("%d\n", sizeof(a));//a是二维数组的数组名，数组名单独放在sizeof内部，计算的是数组的总大小，单位是字节
//	//48
//	printf("%d\n", sizeof(a[0][0]));//a[0][0]是一个整型元素，大小是4个字节
//	printf("%d\n", sizeof(a[0]));//把二维数组的每一行看做一维数组的时候，a[0]是第一行的数组名，第一行的数组名单独放在sizeof内部
//	//计算的是第一行的总大小，单位是字节 - 16
//	printf("%d\n", sizeof(a[0] + 1));//a[0]虽然是第一行的数组名，但是并非单独放在sizeof内部
//	//a[0]作为第一行的数组名并非表示整个第一行这个数组，a[0]就是第一行首元素的地址，a[0]--> &a[0][0] - int*
//	//a[0]+1，跳过一个int，是a[0][1]的地址  4/8字节
//	printf("%d\n", sizeof(*(a[0] + 1)));//a[0]+1是第一行第二个元素的地址，所以*(a[0]+1)就是a[0][1]，大小是4个字节
//	
//	printf("%d\n", sizeof(a + 1));//a是二维数组的数组名，没单独放在sizeof内部，也没有&，所以a就是数组首元素的地址
//	//二维数组，我们把它想象成一维数组，它的第一个元素就是二维数组的第一行
//	//a就是第一行的地址，a+1 是第二行的地址，是地址，大小就是 4/8 个字节
//	//a - &a[0]
//	//a+1 - &a[1]
//	//a+2 - &a[2]
//
//	printf("%d\n", sizeof(*(a + 1)));//a+1是第二行的地址，*(a+1) 找到的就是第二行，sizeof(*(a + 1))计算的就是第二行的大小
//	//16
//	//*(a+1) --> a[1]
//	//sizeof(*(a + 1)) --> sizeof(a[1])
//	//
//	printf("%d\n", sizeof(&a[0] + 1));//&a[0]是第一行的地址，&a[0]+1就是第二行的地址，sizeof(&a[0] + 1)计算的第二行地址大小
//	//单位是字节 - 4/8
//
//	printf("%d\n", sizeof(*(&a[0] + 1)));//&a[0] + 1是第二行的地址，*(&a[0] + 1)拿到的就是第二行，大小就是16个字节
//	//*(&a[0]+1) --> a[1]
//
//	printf("%d\n", sizeof(*a));//a表示首元素的地址，就是第一行的地址 - &a[0]
//	//*a - 拿到的就是第一行 - 大小就是16个字节
//	//*a -> *(a+0) -> a[0]
//	//
//	printf("%d\n", sizeof(a[3]));//代码没问题
//	//a[3]是二维数组的第4行，虽然没有第四行，但是类型能够确定，大小就是确定的。大小就是一行的大小，单位是字节 - 16
//	//能够分析出 a[3]的类型是：int [4]
//	// 
//	//任何一个表达式有2个属性
//	//3+5
//	//值属性：8
//	//类型属性：int
//
//	return 0;
//}


//int main()
//{
//	short num = 20;
//	int a = 1;
//	printf("%d\n", sizeof(num = a + 5));
//	printf("%d\n", num);
//
//	return 0;
//}
//
//int main()
//{
//	int a[5] = { 1, 2, 3, 4, 5 };
//
//	int* ptr = (int*)(&a + 1);
//	printf("%d,%d", *(a + 1), *(ptr - 1));
//
//	return 0;
//}
//

//由于还没学习结构体，这里告知结构体的大小是20个字节
//考察的是指针+-整数的问题
//
//struct Test
//{
//	int Num;
//	char* pcName;
//	short sDate;
//	char cha[2];
//	short sBa[4];
//}* p;//p是一个结构体指针变量
//
////X86环境下演示：
////假设p 的值为0x100000。 如下表表达式的值分别为多少？
////已知，结构体Test类型的变量大小是20个字节
//int main()
//{
//	p = (struct Test*)0x100000;
//	printf("%p\n", p + 0x1);//0x100014
//	printf("%p\n", (unsigned long)p + 0x1);//0x100001
//	printf("%p\n", (unsigned int*)p + 0x1);//0x100004
//
//	return 0;
//}
//

//
//int main()
//{
//	int a[4] = { 1, 2, 3, 4 };
//
//	int* ptr1 = (int*)(&a + 1);
//	int* ptr2 = (int*)((int)a + 1);
//	printf("%x,%x", ptr1[-1], *ptr2);
//
//	//%p - 是打印地址
//	//%x - 是16进制的格式打印
//	return 0;
//}

//#include <stdio.h>
//
//int main()
//{
//	//数组的初始化内容有逗号表达式，实际上数组初始化的是1,3,5
//	int a[3][2] = { (0, 1), (2, 3), (4, 5) };
//	//int a[3][2] = {{0,1}, {2,3}, {4,5}};
//
//	int* p;
//	p = a[0];
//	printf("%d", p[0]);//?
//
//	return 0;
//}
//

//int main()
//{
//	int a[5][5];
//	int(*p)[4];
//
//	p = a;
//	printf("%p,%d\n", &p[4][2] - &a[4][2], &p[4][2] - &a[4][2]);
//
//	return 0;
//}
//
//
//int main()
//{
//	int aa[2][5] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
//
//	int* ptr1 = (int*)(&aa + 1);
//	int* ptr2 = (int*)(*(aa + 1));
//
//	printf("%d,%d", *(ptr1 - 1), *(ptr2 - 1));
//
//	return 0;
//}
//

//#include <stdio.h>
//
//int main()
//{
//	char* a[] = { "work","at","alibaba" };
//	char** pa = a;
//	pa++;
//	printf("%s\n", *pa);
//	return 0;
//}


